Tekla.Structures.Analysis.AnalysisModel.AxisLocationEnum
The axis location.

Tekla.Structures.Analysis.AnalysisModel.AxisLocationEnum.REFERENCE_AXIS_WITH_ECCENTRICITY
The axis location is the reference axis with eccentricity.

Tekla.Structures.Analysis.AnalysisModel.AxisLocationEnum.REFERENCE_AXIS
The axis location is the reference axis.

Tekla.Structures.Analysis.AnalysisModel.AxisLocationEnum.MODEL_PART
The axis location setting of each part is used.

Tekla.Structures.Analysis.AnalysisModel.AxisLocationEnum.NEUTRAL_AXIS
The axis location is the neutral axis.